In [1]:
import pandas as pd

In [6]:
pwd

'C:\\Users\\HP'

In [13]:
 df = pd.read_csv('Grocery.csv')

In [14]:
df

,Order ID,Customer Name,Category,Sub Category,City,Order Date,Region,Sales,Discount,Profit,State
0,OD1,Harish,Oil & Masala,Masalas,Vellore,11/8/2017,North,1254,0.12,401.28,Tamil Nadu
1,OD2,Sudha,Beverages,Health Drinks,Krishnagiri,11/8/2017,South,749,0.18,149.80,Tamil Nadu
2,OD3,Hussain,Food Grains,Atta & Flour,Perambalur,6/12/2017,West,2360,0.21,165.20,Tamil Nadu
3,OD4,Jackson,Fruits & Veggies,Fresh Vegetables,Dharmapuri,10/11/2016,South,896,0.25,89.60,Tamil Nadu
4,OD5,Ridhesh,Food Grains,Organic Staples,Ooty,10/11/2016,South,2355,0.26,918.45,Tamil Nadu
...,...,...,...,...,...,...,...,...,...,...,...
114,OD115,Muneer,Snacks,Noodles,Salem,8/25/2015,East,2420,0.11,242.00,Tamil Nadu
115,OD116,Rumaiza,Snacks,Chocolates,Karur,8/25/2015,East,1305,0.24,287.10,Tamil Nadu
116,OD117,Hussain,Fruits & Veggies,Organic Fruits,Bodi,8/25/2015,East,927,0.20,157.59,Tamil Nadu
117,OD118,Arvind,Fruits & Veggies,Organic Vegetables,Viluppuram,3/2/2016,West,983,0.11,186.77,Tamil Nadu
118,OD119,Akash,Food Grains,Rice,Chennai,4/5/2016,South,903,0.10,90.30,Tamil Nadu

In [15]:
df.head()

,Order ID,Customer Name,Category,Sub Category,City,Order Date,Region,Sales,Discount,Profit,State
0,OD1,Harish,Oil & Masala,Masalas,Vellore,11/8/2017,North,1254,0.12,401.28,Tamil Nadu
1,OD2,Sudha,Beverages,Health Drinks,Krishnagiri,11/8/2017,South,749,0.18,149.80,Tamil Nadu
2,OD3,Hussain,Food Grains,Atta & Flour,Perambalur,6/12/2017,West,2360,0.21,165.20,Tamil Nadu
3,OD4,Jackson,Fruits & Veggies,Fresh Vegetables,Dharmapuri,10/11/2016,South,896,0.25,89.60,Tamil Nadu
4,OD5,Ridhesh,Food Grains,Organic Staples,Ooty,10/11/2016,South,2355,0.26,918.45,Tamil Nadu

In [16]:
df.tail()

,Order ID,Customer Name,Category,Sub Category,City,Order Date,Region,Sales,Discount,Profit,State
114,OD115,Muneer,Snacks,Noodles,Salem,8/25/2015,East,2420,0.11,242.00,Tamil Nadu
115,OD116,Rumaiza,Snacks,Chocolates,Karur,8/25/2015,East,1305,0.24,287.10,Tamil Nadu
116,OD117,Hussain,Fruits & Veggies,Organic Fruits,Bodi,8/25/2015,East,927,0.20,157.59,Tamil Nadu
117,OD118,Arvind,Fruits & Veggies,Organic Vegetables,Viluppuram,3/2/2016,West,983,0.11,186.77,Tamil Nadu
118,OD119,Akash,Food Grains,Rice,Chennai,4/5/2016,South,903,0.10,90.30,Tamil Nadu

In [18]:
# Average Sales of all the customers
df['Sales'].mean()

1422.7478991596638

In [19]:
# highest sales 
df['Sales'].max()

2468

In [23]:
# what cities did Hussain order from
df[df['Customer Name'] == 'Hussain']['City']

,Order ID,Customer Name,Category,Sub Category,City,Order Date,Region,Sales,Discount,Profit,State
2,OD3,Hussain,Food Grains,Atta & Flour,Perambalur,6/12/2017,West,2360,0.21,165.20,Tamil Nadu
116,OD117,Hussain,Fruits & Veggies,Organic Fruits,Bodi,8/25/2015,East,927,0.20,157.59,Tamil Nadu

In [22]:
# how much sales did Hussain's order generate
df[df['Customer Name'] == 'Hussain']['Sales'].sum()

3287

In [24]:
# how much profit did Jackson's order generate
df[df['Customer Name'] == 'Jackson']['Profit'].sum()

490.99

In [28]:
# How many orders were made from the East
df[df['Region'] == 'East']['Order ID'].count()

26

In [29]:
# how much profit was made from the East
df[df['Region'] == 'East']['Profit'].sum()

8994.37

In [30]:
# how much sales was made from the East
df[df['Region'] == 'East']['Sales'].sum()

36490

In [31]:
# How many orders were made from the West
df[df['Region'] == 'West']['Order ID'].count()

34

In [32]:
# how much profit was made from the West
df[df['Region'] == 'West']['Profit'].sum()

10765.33

In [33]:
# how much sales was made from the West
df[df['Region'] == 'West']['Sales'].sum()

44839

In [34]:
# How many orders were made from the South
df[df['Region'] == 'South']['Order ID'].count()

17

In [35]:
# how much profit was made from the South
df[df['Region'] == 'South']['Profit'].sum()

7168.72

In [36]:
# how much sales was made from the South
df[df['Region'] == 'South']['Sales'].sum()

25611

In [37]:
# How many orders were made from the North
df[df['Region'] == 'North']['Order ID'].count()

1

In [38]:
# how much profit was made from the North
df[df['Region'] == 'North']['Profit'].sum()

401.28

In [39]:
# how much sales was made from the North
df[df['Region'] == 'North']['Sales'].sum()

1254

In [40]:
# Customer with the highest sales order
df[df['Sales']== df['Sales'].max()]

,Order ID,Customer Name,Category,Sub Category,City,Order Date,Region,Sales,Discount,Profit,State
71,OD72,Yusuf,Snacks,Noodles,Kanyakumari,9/14/2018,Central,2468,0.18,1011.88,Tamil Nadu

In [41]:
# Customer with the lowest sales order
df[df['Sales']== df['Sales'].min()]

,Order ID,Customer Name,Category,Sub Category,City,Order Date,Region,Sales,Discount,Profit,State
20,OD21,Hafiz,Beverages,Health Drinks,Vellore,8/27/2015,West,522,0.19,208.8,Tamil Nadu

In [42]:
# top 5 names with the most orders 
df['Customer Name'].value_counts().head(5)

Willams    6
Sharon     6
Mathew     4
Muneer     4
Arvind     4
Name: Customer Name, dtype: int64

In [68]:
# customers with the cumulative sales
df.groupby('Customer Name').sum()['Sales']

Customer Name
Adavan      4423
Akash       3066
Alan        4316
Amrish      2922
Amy         3752
Anu         3856
Arutra      3485
Arvind      6418
Esther      1662
Ganesh      1903
Hafiz       3160
Harish      1254
Haseena     3183
Hussain     3287
Jackson     1875
James        934
Jonas       2577
Komal       3744
Krithika    7170
Kumar       2027
Malik        660
Mathew      6484
Muneer      7135
Peer        2509
Ram         2257
Ramesh      6242
Ravi        6637
Ridhesh     3081
Roshan      5356
Rumaiza     1305
Sabeela     3310
Shah        3295
Sharon      7396
Sheeba      2111
Shree       3300
Sudeep       921
Sudha       4022
Sundar      2858
Suresh      3715
Veena       5157
Verma       1686
Veronica    3477
Vidya       2931
Vince       3721
Vinne       3089
Willams     6101
Yadav        701
Yusuf       4836
Name: Sales, dtype: int64

In [65]:
# how many unique customers are there
df['Customer Name'].nunique()

48

In [71]:
# Products with the highest sales generated
df.groupby('Category').sum()['Sales']

Category
Bakery               16031
Beverages            28863
Eggs, Meat & Fish    20178
Food Grains          28654
Fruits & Veggies     29609
Oil & Masala         18519
Snacks               27453
Name: Sales, dtype: int64

In [78]:
df.groupby('Customer Name').sum()['Profit']

Customer Name
Adavan      1233.44
Akash        760.83
Alan         544.68
Amrish      1147.19
Amy         1293.79
Anu          907.58
Arutra       729.63
Arvind       490.67
Esther       214.14
Ganesh       437.69
Hafiz        538.49
Harish       401.28
Haseena      599.72
Hussain      322.79
Jackson      490.99
James         56.04
Jonas        627.08
Komal        577.62
Krithika    1668.57
Kumar        912.15
Malik         92.40
Mathew      2288.48
Muneer      1662.36
Peer         618.25
Ram          270.84
Ramesh      1009.69
Ravi        1647.55
Ridhesh      962.01
Roshan      1863.13
Rumaiza      287.10
Sabeela     1448.60
Shah         622.67
Sharon      2318.11
Sheeba       189.99
Shree        949.89
Sudeep       184.20
Sudha        972.83
Sundar       821.33
Suresh      1544.40
Veena       1259.49
Verma        517.00
Veronica    1068.29
Vidya        630.68
Vince        746.17
Vinne        628.05
Willams     1819.60
Yadav        308.44
Yusuf       1855.29
Name: Profit, dtype: float64

In [80]:
df.groupby('Customer Name').count()['Order ID']

Customer Name
Adavan      2
Akash       2
Alan        4
Amrish      2
Amy         3
Anu         3
Arutra      2
Arvind      4
Esther      2
Ganesh      1
Hafiz       3
Harish      1
Haseena     3
Hussain     2
Jackson     2
James       1
Jonas       2
Komal       3
Krithika    4
Kumar       1
Malik       1
Mathew      4
Muneer      4
Peer        2
Ram         1
Ramesh      4
Ravi        3
Ridhesh     2
Roshan      4
Rumaiza     1
Sabeela     2
Shah        2
Sharon      6
Sheeba      1
Shree       2
Sudeep      1
Sudha       3
Sundar      3
Suresh      2
Veena       3
Verma       2
Veronica    2
Vidya       2
Vince       2
Vinne       3
Willams     6
Yadav       1
Yusuf       3
Name: Order ID, dtype: int64

In [82]:
df.groupby('Customer Name').sum()['Discount']

Customer Name
Adavan      0.61
Akash       0.36
Alan        0.97
Amrish      0.32
Amy         0.66
Anu         0.97
Arutra      0.37
Arvind      0.61
Esther      0.57
Ganesh      0.13
Hafiz       0.74
Harish      0.12
Haseena     0.89
Hussain     0.41
Jackson     0.47
James       0.35
Jonas       0.52
Komal       0.93
Krithika    0.76
Kumar       0.34
Malik       0.19
Mathew      0.89
Muneer      0.63
Peer        0.39
Ram         0.33
Ramesh      0.84
Ravi        0.55
Ridhesh     0.44
Roshan      0.75
Rumaiza     0.24
Sabeela     0.45
Shah        0.47
Sharon      1.31
Sheeba      0.21
Shree       0.28
Sudeep      0.25
Sudha       0.58
Sundar      0.46
Suresh      0.45
Veena       0.74
Verma       0.60
Veronica    0.34
Vidya       0.42
Vince       0.47
Vinne       0.39
Willams     1.64
Yadav       0.10
Yusuf       0.82
Name: Discount, dtype: float64

In [83]:
df.groupby('Category').sum()['Profit']

Category
Bakery               3844.90
Beverages            7147.16
Eggs, Meat & Fish    6711.87
Food Grains          7289.60
Fruits & Veggies     6158.04
Oil & Masala         4484.65
Snacks               6904.99
Name: Profit, dtype: float64

In [84]:
df.groupby('City').sum()['Profit']

City
Bodi              2138.26
Chennai           2618.00
Coimbatore        3021.39
Cumbum            1215.05
Dharmapuri        3195.15
Dindigul          1557.05
Kanyakumari       2860.61
Karur             1807.19
Krishnagiri       2345.92
Madurai           2291.74
Nagercoil          745.97
Namakkal          1177.26
Ooty              3228.30
Perambalur         644.65
Pudukottai         664.96
Ramanadhapuram     778.69
Salem             2232.26
Tenkasi            464.06
Theni              815.78
Tirunelveli       2052.02
Trichy            2463.66
Vellore           1768.59
Viluppuram        1331.00
Virudhunagar      1123.65
Name: Profit, dtype: float64

In [85]:
df.groupby('City').sum()['Sales']

City
Bodi               9118
Chennai            9715
Coimbatore         8303
Cumbum             3575
Dharmapuri        14611
Dindigul           5943
Kanyakumari       10853
Karur              6456
Krishnagiri        8880
Madurai            9717
Nagercoil          2742
Namakkal           5105
Ooty               9821
Perambalur         5177
Pudukottai         4106
Ramanadhapuram     4170
Salem             10780
Tenkasi            2726
Theni              3897
Tirunelveli        6994
Trichy             8756
Vellore            9044
Viluppuram         4919
Virudhunagar       3899
Name: Sales, dtype: int64